3D_Cylinder_Re3900/M/0/muTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 1e-10;

boundaryField
{
    periodic_p
    {
        type            cyclic;
    }

    periodic_m
    {
        type            cyclic;
    }
    Cylinder
    {
         type            fixedValue;
         value           uniform 1e-10;
    }

    Outlet
    {
        type            zeroGradient;
    }

    Inlet
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
